rebet.org
#+TITLE: Rebet.el -- Manage my rebetika collection
#+AUTHOR: dakodeon
#+EMAIL: dakodeon@hotmail.com

* TODO TODO list [2/5]
  
** TODO Clean up introduction

   Update the info as we write the code, make it smaller.

** TODO Fix rebet--attributes

   Decide whether it should be a list of property lists or a list of empty
   symbols with properties. Also, include a 'val' field either way.

** TODO Delete lines with the same path from ref-file

   When updating the tags, first check for a line containing the same path
   and remove it.

   Thought: maybe just use the filename, that way we are covered while
   moving stuff around.

   Fix buggy behaviour when renaming files. In which way can we have access
   to the new name? maybe a property?

** DONE Write dired part
   CLOSED: [2020-05-14 Thu 20:34]

   Mainly the add metadata part. It should also update the lyrics file, if
   it finds same title?

   Add an option to update the same tag to a bunch of files.

** DONE Search capabilities
   CLOSED: [2020-05-14 Thu 20:34]

   Make use of the ref-file. eg Search and replace tags

* INTRODUCTORY NOTES

** What is this file?

   This file contains all the code that I came up with in order to manage
   my ever-growing rebetika collection, both songs and lyrics. The code
   started to get out of hand if keeping it all in my emacs config file, so
   I decided to make it it's own package. That way, the code is kept
   organized and does not clutter my config.

** What is the need for such a file?

   I play and sing rebetika songs. For this particular kind of music, it is
   not strange if you know how to play hundreds of songs. So, I always had
   the problem of keeping track of the songs I know, alongside with their
   lyrics, which is very useful, either for personal use, or when
   collaborating with other musicians.

** The logic

   From early on, I started wondering how I could organize my songs
   collection. Due to the fact that all the songs are in mp3 format, I
   decided to use ID3 tags, which also allow for custom tags, very useful
   for keeping track of information specific to a rebetiko song, like
   rhythm (zeibekiko, tsifteteli etc.) or /dromos/ (greek word for 'road',
   'way'), meaning a type of scale used in rebetiko music, a westerized
   version of oriental scales, coming from arabic /'maquams'/.

   I wrote a shell script, =mp3-tag-editor=, which can be found in my
   [[https://github.com/dakodeon/dotfiles][dotfiles]], which allows for batch-editing of ID3 tags, with optional
   renaming of the actual file, according to a naming template defined in
   the said script's help text. For this task, the script makes use of the
   programs =ffprobe= (which comes with =ffmpeg=), for retrieving existing
   tags and =eyeD3=, which edits the tags themselves and, as I noticed, has a
   very good handling of UTF-8 text.

   =fzf=, a fuzzy-searcher used to locate songs, which is interfaced into
   emacs by the =counsel-fzf= function, is also required for this package.

   In parallel, I kept a lyrics file, initially as an odt file, but I soon
   turn it into an org file, as I got more and more into Emacs. The final
   structure of this file is very simple, each song has it's own entry,
   with the heading being the song's title, and all other information is
   stored as org properties. My final goal is to be able to export this
   file as a pdf, according to specified properties and tags, but I am not
   there yet.

   Here is a list of the ID3 tags used, alongside with their respective org
   properties and a description:

   |----------+--------------+---------------------------------------------------|
   | ID3 tag  | org property | description                                       |
   |----------+--------------+---------------------------------------------------|
   | title    | ITEM         | The song's title (ITEM refers to the org heading) |
   | composer | ΣΥΝΘΕΤΗΣ     | The song's composer                               |
   | artist   | ΤΡΑΓΟΥΔΙΣΤΗΣ | The song's singer                                 |
   | rhythm   | ΡΥΘΜΟΣ       | The song's rhythm                                 |
   | dromos   | ΔΡΟΜΟΣ       | The song's dromos (scale)                         |
   | tone     | ΤΟΝΟΣ        | The song's tonality                               |
   |----------+--------------+---------------------------------------------------|

   After this minimum of organizing stuff, I wanted to have a system which
   would integrate the lyrics file with my collection, basically being able
   to link files to lyrics, as well as sharing between ID3 tags and
   org-properties, while managing the ID3 tags insertion from dired.

   This is the initial description, all parts will be described as we
   proceed.

** Overview analysis

   Here I will attempt a brief description of the different parts of the
   package.

*** 1. Directory and files structure

    The best approach for keeping things organized is to have a specific
    structure for capturing and storing things. For this task, I define a
    default location for my music collection, assuming that all of the
    organized music tracks will go there, as well as an optional list of
    temp directories, like for example the directory where the song is
    downloaded, before having its ID3 tags set.

    The lyrics are stored also in a specific file.

    Naming the mp3 files is done according to a template, defined in my
    script, as noted above. The lyrics also have their own template, which
    can be also seen in the relevant org-capture template.

    Knowing the specific manner by which things are stored means that it is
    easier to find things and pass information around, which brings us to
    the next topic:

*** 2. Interconnectivity structures

    The simplest example for what I mean is the equivalence of the ID3 tags
    and the org properties. ID3 tags have specific keywords for frequently
    defined attributes, like title or artist, and I keep to the defaults
    where possible for the sake of consistency, but these are not necessarily
    the keywords that I want to use in my lyrics file. So, instead of
    "composer" I have the greek "ΣΥΝΘΕΤΗΣ", insead of "artist" I have
    "ΤΡΑΓΟΥΔΙΣΤΗΣ" etc. Note the use of capital letters, which is not
    mandatory, but I noted this conversion used throughout org-mode, so I
    kept this also for the sake of consistency.

    Besides this interconnected information, there are also other pieces
    that I want to keep related. These include the shell script options for
    setting an ID3 tag and a list used for autocompletion, where desirable.
    Also, a way to store a value and keep it related to the aforementioned
    information.

    The way that I decided to go about this has two integral parts:

    1. A list of property lists, each defining the information related to a
       specific tag.
    2. A file, in which we store all the information about all the mp3
       files in the default directory, including the full path of the file,
       alongside with stored metadata for each one of them.

    From this file, using some string manipulation, we extract various
    pieces of information, forming lists which will help with
    autocompleting tag values. Also, by keeping track of the paths and the
    associated tags, we can easily implement a search function for specific
    tags. The implementations of this are various and, as of now, not yet
    fully explored. Some thoughts include searching by tag, changing a
    specific tag to all the files etc.

    For generating this file, we can either run a dedicated function, which
    parses all the mp3 files in the default directory, or generate it as we
    populate the tags, one by one. Adding to this file happens whenever a
    file has its tags updated.

*** 3. Syncing between mp3 files and lyrics

    The functionality regulating this matter consists of two functions, one
    that updates org-properties based on ID3 tags and one that does the
    opposite, updates ID3 tags based on org-properties.

    There is also a third function, which just calls the other two
    sequentially, first updating the properties and then updating the ID3
    tags. That way, after inserting existing tags as properties, we can
    update whichever of those remain unset, and update back the ID3 tags of
    the file with the new information inserted.

    There is no automation for this task, i.e to parse the lyrics file and
    update all entries and properties. This happens because there is no
    guarantee that a lyrics entry has an associated file, or that the
    associated file will have the same name. It would be useful however, to
    write a function like that, which will write all existing tags when
    finding a match.

*** 4. Setting ID3 tags per file

    This is the main interface with the mp3-tag-editor script, and is
    implemented in two versions. One is the simplest interface possible, it
    runs the script inside a term buffer and works exactly like opening a
    terminal and running the script, the other is a full fledged interface,
    where we can use autocompletion, search and replace tags etc, while
    also updating the reference file and variables. Both implementations
    act on the marked files of a dired buffer.
   
   
* THE CODE
  
** Initial part, comments setting up the package

   #+begin_src emacs-lisp
   ;;; rebet.el --- rebetika songs tags and lyrics management

   ;; Author: dakodeon
   ;; Keywords: music, dired, org-mode, organize, lyrics

   ;;; Commentary:

   ;; This package is used to manage my collection of rebetika songs. These
   ;; are organized in a specified directory, with well-defined id3 tags, and
   ;; the same naming convention derived from my personal script
   ;; (mp3-tag-editor). At the same time, I keep a lyrics file, written in
   ;; org-mode, each entry being a song with properties, which are the same as
   ;; the id3 tags.

   ;; The idea is that the lyrics file should be inter-connected with the
   ;; actual songs. This means the ability to find the song from the lyrics
   ;; and vice-versa, renaming a song title according to it's actual title id3
   ;; tag, passing id3 tags to org-properties and vice-versa. Of course,
   ;; setting the id3 tags themselves should be done in dired, with
   ;; autocompletion for values.

   ;; The id3 tags are organized as such:
   ;; - title: the title of the song
   ;; - composer: the composer of the song
   ;; - artist: the singer(s) of the song
   ;; - year: recording year
   ;; - rhythm: rebetiko-style rhythmic patterns (zeibekiko, tsifteteli etc)
   ;; - dromos: lacking of a better word, "dromos" is a form of scale, derived
   ;; from arabic "maquams"
   ;; - tone: the tonality of the song

   ;; All these have their equivalents in org-properties

   ;; This package depends on some emacs packages, as well as some external tools and a custom script.

   ;; Emacs dependencies: ivy, counsel, counsel-fzf, org-mode, dired
   ;; External dependencies: ffprobe, eyeD3, fzf
   ;; My script is part of my dotfiles (in the scripts directory) and can be
   ;; found here: https://github.com/dakodeon/dotfiles

   ;;; Code:

   #+end_src

** Requirements

   The emacs packages this package needs.

   Dired and org-mode from packages already part of emacs, ivy and counsel
   from MELPA packages.

   NOTE: The requirement of counsel is due to the fact that I use
   =counsel-fzf= to locate songs, maybe I could change that so that it is
   optional.

   Also NOTE: In this section I could also include checks for the required
   programs, as well as for my script.
   
   #+begin_src emacs-lisp
   (require 'ivy)
   (require 'counsel)
   (require 'dired)
   (require 'org)
   #+end_src
   
** Variables

