rebet.el
;;; rebet.el --- rebetika songs tags and lyrics management

;; Author: dakodeon
;; Keywords: music, dired, org-mode, organize, lyrics

;;; Commentary:

;; This package is used to manage my collection of rebetika songs. These
;; are organized in a specified directory, with well-defined id3 tags, and
;; the same naming convention derived from my personal script
;; (mp3-tag-editor). At the same time, I keep a lyrics file, written in
;; org-mode, each entry being a song with properties, which are the same as
;; the id3 tags.

;; The idea is that the lyrics file should be inter-connected with the
;; actual songs. This means the ability to find the song from the lyrics
;; and vice-versa, renaming a song title according to it's actual title id3
;; tag, passing id3 tags to org-properties and vice-versa. Of course,
;; setting the id3 tags themselves should be done in dired, with
;; autocompletion for values.

;; The id3 tags are organized as such:
;; - title: the title of the song
;; - composer: the composer of the song
;; - artist: the singer(s) of the song
;; - year: recording year
;; - rhythm: rebetiko-style rhythmic patterns (zeibekiko, tsifteteli etc)
;; - dromos: lacking of a better word, "dromos" is a form of scale, derived
;; from arabic "maquams"
;; - tone: the tonality of the song

;; All these have their equivalents in org-properties

;; This package depends on some emacs packages, as well as some external tools and a custom script.

;; Emacs dependencies: ivy, counsel, counsel-fzf, org-mode, dired
;; External dependencies: ffprobe, eyeD3, fzf
;; My script is part of my dotfiles (in the scripts directory) and can be
;; found here: https://github.com/dakodeon/dotfiles

;;; Code:

(require 'ivy)
(require 'counsel)
(require 'dired)
(require 'org)

;; variables

;;;###autoload
