rebet.org
*** Basics

    The first set of variables store the default locations used. These are:
   
    - =rebet-default-dir=: The default location where songs are stored. It
      is assumed that all songs in this location have their ID3 tags set,
      ie they are organized.
    - =rebet-dirs-list=: Optional variable, storing a list of directories
      possibly containing rebetika songs, for example the Downloads
      directory. As specified in the help string, using this variable
      overrides the use of =rebet-default-dir= for the most part, so the
      value of said variable should be included in this list, if set.
    - =rebet-lyrics-file=: The file storing the lyrics. It should
      obviously be an org file.
    - =rebet--ref-file=: This file keeps a list of all the mp3 files in the
      =rebet-default-dir=, alongside with all the information stored in ID3
      tags. It is intended to be used for autocompleting values, but also
      as a reference for easy searching and changing data.
      

      #+begin_src emacs-lisp
      ;; variables

      ;;;###autoload
      (defvar rebet-default-dir "~/Music/Ρεμπέτικα"
	"The default directory where songs are stored.")

      (defvar rebet-dirs-list nil
	"An optional list of additional directories where rebetika are stored,
		    besides `rebet-default-dir', eg some download dir.
		    Optionally, you can include the value of
		    `rebet-default-dir` for consistency.")

      ;;;###autoload
      (defvar rebet-lyrics-file "~/stixoi.org"
	"The default file for rebetika lyrics.
      It should be an org file.")

      (defvar rebet--ref-file "~/Music/Ρεμπέτικα/.ref-list"
	"Where to store the reference list used for searching and
	      building autocomp lists")
      #+end_src

*** Dictionary
    
    Here is a "dictionary" of keywords and other information attatched to
    specific tags. Essentially, this is a list of properties' lists. This
    is the backbone of the whole functionality, as it provides the link
    between the tag names, the org properties names and the shell command
    options, as well as keeping lists generated by the =rebet--ref-file=
    for where autocompletion is needed.
    

    #+begin_src emacs-lisp
    ;;; empty symbols (maybe we should make them nil) --- or maybe we should
    ;;; make them not symbols, just a list of properties lists, with a property
    ;;; to store temp values
    (setplist 'rebet--title
	      '(tagname "title" propname "ITEM"
			val nil cmd-opt "-t " eye-opt "--title "))
    (setplist 'rebet--composer
	      '(tagname "composer" propname "ΣΥΝΘΕΤΗΣ"
			val nil cmd-opt "-c " eye-opt "--text-frame=TCOM:" autocomp-lst nil))
    (setplist 'rebet--artist
	      '(tagname "artist" propname "ΤΡΑΓΟΥΔΙΣΤΗΣ"
			val nil cmd-opt "-a " eye-opt "--artist " autocomp-lst nil))
    (setplist 'rebet--rhythm
	      '(tagname "rhythm" propname "ΡΥΘΜΟΣ"
			val nil cmd-opt "-r " eye-opt "--text-frame=rhythm:" autocomp-lst nil))
    (setplist 'rebet--dromos
	      '(tagname "dromos" propname "ΔΡΟΜΟΣ"
			val nil cmd-opt "-d " eye-opt "--text-frame=dromos:" autocomp-lst nil))
    (setplist 'rebet--tone
	      '(tagname "tone" propname "ΤΟΝΟΣ"
			val nil cmd-opt "-n " eye-opt "--text-frame=tone:" autocomp-lst
			("Ντο" "Ντο#" "Ρε" "Ρε#" "Μι" "Φα" "Φα#" "Σολ" "Σολ#" "Λα" "Λα#" "Σι")))
    (setplist 'rebet--year
	      '(tagname "date" propname "ΕΤΟΣ_ΗΧΟΓΡ"
			val nil cmd-opt "-y " eye-opt "--release-year "))

    ;;;###autoload
    (defvar rebet--attributes
      '(rebet--title rebet--composer rebet--artist
		     rebet--rhythm rebet--dromos rebet--tone rebet--year))
    #+end_src

** Internal functions

   Functions used by functions. These are not supposed to be used
   interactively, but perform some repeated tasks used by the interactive
   ones.

   - =rebet--get-data-from-id3=: Makes a list of ID3 values for a given
     file.
   - =rebet--get-data-from-props=: Makes a list of org-properties for a
     given (the current) entry
   - =rebet--make-tag-cmd=: Generates the string expressing the command
     used to set ID3 tags.
   - =rebet--from-list-to-file=: Generates a file with the contents of a
     list variable.
   - =rebet--set-fzf-cmd=: Builds the string used to set the environmental
     variable =FZF_DEFAULT_COMMAND= to include the directories specified in
     =rebet-default-dir= and/or =rebet-dirs-list=.
   - =missing command about adding to the ref file=
   - =rebet--make-ref-file=: Runs through all mp3 files in
     =rebet-default-directory=, and writes to =rebet-ref-file=.
   - =rebet--make-ref-lists=: Parses =rebet-ref-file= (which should already
     be created) and adds lists of values where required by
     =rebet--attributes=. This command, as well as the previous one, are
     interactively called together by the function =rebet-update-all-refs=
     (see next section).
     

     #+begin_src emacs-lisp
     ;; internal functions
     (defun rebet--get-data-from-id3 (path)
       "Returns an alist based on the ID3 tags of file in PATH."
       (mapcar (lambda (x)
		 (let ((pair (split-string x "=" t "TAG:")))
		   (cons (car pair) (nth 1 pair))))
	       (seq-remove (lambda (str) (string-match-p "FORMAT" str))
			   (process-lines
			    "ffprobe" "-loglevel" "error" "-show_entries"
			    "format_tags=title,composer,artist,rhythm,dromos,tone,date"
			    (expand-file-name path)))))

     (defun rebet--get-data-from-props ()
       "Returns an alist based on the org properties of the current entry.
	  Makes sense to use only in the lyrics file (`rebet-lyrics-file')."
       (let ((props (org-entry-properties)))
	 (mapcar (lambda (attr)
		   (cons (get attr 'tagname)
			 (cdr (assoc (get attr 'propname) props))))
		 rebet--attributes)))

     (defun rebet--make-tag-cmd (path rename val-list)
       "Makes the string of the command that will set the ID3 tags of the file
     in PATH. If RENAME is non-nil, the option to rename the file will be added.
     VAL-LIST should be an alist similar to the output of
     `rebet--get-data-from-id3', ie of the form ((\"composer\" . \"composer
     name\") (\"artist\" .\"artist name\")) etc. Nil values will be ignored and
     will not activate the corresponding option."
       (let ((optlist (mapcar
		       (lambda (attr)
			 (cons (get attr 'tagname) (get attr 'cmd-opt)))
		       rebet--attributes)))
	 (concat "mp3-tag-editor -EX" (if rename "R " " ")
		 (mapconcat
		  (lambda (x)
		    (let ((val (cdr (assoc (car x) val-list))))
		      (if (and val (not (string-match-p "^ *$" val)))
			  (concat (cdr x) (shell-quote-argument val) " ")
			"")))
		  optlist "")
		 (shell-quote-argument path))))

     (defun rebet--from-list-to-file (lst file)
       "Build a file from a list."
       (with-temp-file (expand-file-name file)
	 (insert (mapconcat 'identity lst "\n"))))

     (defun rebet--set-fzf-cmd ()
       "Builds the string for the default fzf command used to search
		 for rebetika."
       (concat "FZF_DEFAULT_COMMAND=find "
	       (mapconcat 'identity
			  (delete-dups
			   (push rebet-default-dir rebet-dirs-list)) " ")
	       " -name \"*.mp3\""))

     (defun rebet--make-ref-line (path var-list)
       "Creates the string to put in ref file."
       (concat "|" (mapconcat
		    (lambda (x) (concat (car x) ":" (cdr x)))
		    var-list "|")
	       "|path:" path))

     (defun rebet--make-ref-file ()
       "Makes the reference file, located in `rebet--ref-file',
	  according to the mp3 files in `rebet-default-dir'. It can take
	  some time to complete, depending on the number of files."
       (rebet--from-list-to-file
	(mapcar
	 (lambda (file)
	   (message "%s" file)
	   (let ((song-data (rebet--get-data-from-id3 file)))
	     (rebet--make-ref-line file song-data)))
	 (directory-files-recursively (expand-file-name rebet-default-dir) "mp3"))
	rebet--ref-file))

     (defun rebet--make-ref-lists ()
       "Makes the reference lists according to the contents of
	  `rebet--ref-file'."
       (unless (file-exists-p rebet--ref-file)
	 (user-error
	  "ERROR: The file \"%s\" does not exist. Run M-x rebet-update-all-refs"
	  rebet--ref-file))
       (with-temp-buffer
	 (insert-file-contents (expand-file-name rebet--ref-file))
	 (mapc (lambda (attr)
		 (put attr 'autocomp-lst
		      (remove
		       ""
		       (delete-dups
			(mapcar
			 (lambda (ln)
			   (let ((rgx (concat "^.*" (get attr 'tagname) ":\\||.*$")))
			     (replace-regexp-in-string rgx "" ln)))
			 (split-string (buffer-string) "\n"))))))
	       (seq-remove (lambda (x)
			     (or
			      (not (member 'autocomp-lst (symbol-plist x)))
			      (string= (get x 'tagname) "tone")))
			   rebet--attributes))))

     (defun rebet--add-line-to-ref (path var-list)
       "Adds a new line in the `rebet--ref-file', for a file with path
       PATH and the data included in VAR_LIST. First it checks for
       lines referring to the same filename (independently of the
       directory) and removes them. It will also update the
       autocomp-lists. VAR-LIST should be an alist, similar to the
       output of `rebet--get-data-from-id3'."
       (let* ((filename (file-name-base path))
	      (path (expand-file-name path))
	      (ref-file (expand-file-name rebet--ref-file)))
	 (with-temp-file ref-file
	   (insert-file-contents ref-file)
	   (delete-matching-lines (concat "path:.*" filename "\\.mp3") (point-min) (point-max))
	   (insert (concat (rebet--make-ref-line path var-list) "\n"))))
       (rebet--make-ref-lists))
     #+end_src

