rebet.org
** Interactive functions

   These provide the main interface of the package.

   - =rebet-update-all-refs=: Calls secuentially the functions
     =rebet--make-ref-file= and =rebet--make-ref-lists=, thus initializing
     the =rebet--ref-file= as well as the autocompletion lists. It parses
     all the mp3 files in the default directory, so it might take some time
     to finish.
   - =rebet-tags-to-props=: Usable only in =rebet-lyrics-file=. Sets the
     org-properties by reading ID3 tags from a file. The file is located by
     the user with fzf search. If the title of the song is different from
     the header of the entry then the header gets replaced by the title.
   - =rebet-props-to-tags=: Usable only in the lyrics file. Sets the ID3
     tags of a file according to the org-properties of the current entry.
     The file is located by the user with fzf search. Optionally, it sets
     the title to be the entry header and renames the file.
   - =rebet-tags-to-props-and-back=: Calls the two previous functions
     sequentially, effectively writing org properties and then updating the
     ID3 tags.
   - =rebet-dired-simple-tags=: The simplest way to set ID3 tags on a file.
     Acts on marked files in a dired buffer and opens a term window running
     my =mp3-tag-editor= script. It does not autocomplete, and does not add
     new values to the lists.
   - =missing dired tag setter, full fledged=

     #+begin_src emacs-lisp
      ;; interactive functions

     ;;;###autoload
     ;; this is out!
     (defun rebet-update-all-refs ()
       "Run to initialize reference file and variables, according to
     the mp3 files in `rebet-default-dir'. Calls
     `rebet--make-ref-file' and `rebet--make-ref-lists'
     consecutively."
       (interactive)
       (rebet--make-ref-file)
       (rebet--make-ref-lists))

     ;;;###autoload
     (defun rebet-tags-to-props (&optional path)
	"Works only in `rebet-lyrics-file'. Reads ID3 tags from a
	selected mp3 file and converts them to org-properties in the
	entry at point. It also updates the heading, in case it
	differs from the actual title. If PATH is specified, it reads
	from this file, else it calls counsel-fzf."
       (interactive)
       (unless (string= buffer-file-name (expand-file-name rebet-lyrics-file))
	 (user-error "Error: Not in the lyrics file (%s)" rebet-lyrics-file))
       (let* ((process-environment (cons (rebet--set-fzf-cmd)
					 process-environment))
	      (path (if path (expand-file-name path)
		      (l/counsel-fzf-as-text "Get props from: ")))
	      (song-data (rebet--get-data-from-id3 path))
	      (entry-data (org-entry-properties)))
	 (mapc (lambda (attr)
		 (org-set-property
		  (get attr 'propname) (cdr (assoc (get attr 'tagname) song-data))))
	       (seq-remove (lambda (x) (string= (get x 'tagname) "title"))
			   rebet--attributes))
	 (mapc (lambda (x)
		 (if (string-match-p "^ *$" (cdr (assoc (get x 'propname)
							(org-entry-properties))))
		     (org-delete-property (get x 'propname))))
	       rebet--attributes)
	 (org-edit-headline (cdr (assoc "title" song-data))))
	 ;; do not update data -- thought: maybe use rebet-autocompletion?
	 (if mark-active (deactivate-mark t)))

     ;;;###autoload
     ;; this will be redesined
     (defun rebet-props-to-tags (&optional path)
	"Works only in `rebet-lyrics-file'. Reads the properties from
	the current entry and converts them to ID3 tags of a selected
	mp3 file, also renaming it if necessary. If PATH is provided,
	it acts on this file, else it calls counsel-fzf."
       (interactive)
       (unless (string= buffer-file-name (expand-file-name rebet-lyrics-file))
	 (user-error "Error: Not in the lyrics file (%s)" rebet-lyrics-file))
       (let* ((process-environment (cons (rebet--set-fzf-cmd)
					 process-environment))
	      (song-data (rebet--get-data-from-props))
	      (path (if path (expand-file-name path)
		      (l/counsel-fzf-as-text "Give props to: "))))
	 (shell-command (rebet--make-tag-cmd path t song-data))
	 (rebet--add-line-to-ref path song-data))
       (if mark-active (deactivate-mark t)))


     ;;;###autoload
     (defun rebet-tags-to-props-and-back (&optional path)
       "Sequentially calls `rebet-tags-to-props' and
	`rebet-org-to-tags' on a specified file. If PATH is set it
	acts on this file, if not, it calls counsel-fzf."
       (interactive)
       (let* ((process-environment
	       (cons (rebet--set-fzf-cmd) process-environment))
	      (path (if path (expand-file-name path)
		      (l/counsel-fzf-as-text "Props come and go :"))))
	 (rebet-tags-to-props path)
	 (rebet-props-to-tags path)))

     ;;;###autoload
     ;; this is ok
     (defun rebet-dired-mp3-tag-editor ()
       "Simple interface directly to the mp3-tag-editor shell script,
	using `make-term'. No completions and no updating lists etc
	with new values. Acts on the marked files of the current dired
	buffer."
       (interactive)
       (let ((files (dired-get-marked-files)))
	 (apply 'make-term "mp3-tag-editor" "sh" nil "mp3-tag-editor" "-ER" files)
	 (switch-to-buffer-other-window "*mp3-tag-editor*")))

     ;;;###autoload
     (defun rebet-dired-set-tags ()
       (interactive)
       (rebet--make-ref-lists)
       (let ((files (dired-get-marked-files)))
	 (mapc (lambda (file)
		 (let ((def-values (rebet--get-data-from-id3 file))
		       (fname (file-name-base file)))
		   (mapc (lambda (attr)
			   (let ((defval (cdr (assoc (get attr 'tagname) def-values))))
			     (put attr 'val
				  (completing-read
				   (concat fname " | " (get attr 'tagname) ": ")
				   (get attr 'autocomp-lst) nil nil defval))))
			 rebet--attributes)
		   (let ((new-data (mapcar (lambda (x)
				   (cons (get x 'tagname) (get x 'val)))
					   rebet--attributes)))
		     (shell-command (rebet--make-tag-cmd file t new-data))
		     (rebet--make-ref-line file new-data)))
		 (rebet--make-ref-lists))
	       files))
       (revert-buffer))

     (defun rebet-dired-set-tag-to-all ()
       "Set a tag to every file in the marked files."
       (interactive)
       (rebet--make-ref-lists)
       (let* ((files (dired-get-marked-files))
	      (tag (completing-read "Set which tag? "
				    (mapcar (lambda (x) (get x 'tagname)) rebet--attributes) nil t))
	      (symb (seq-find (lambda (x) (string= (get x 'tagname) tag)) rebet--attributes))
	      (val (completing-read (concat "Set " tag " value: ")
				    (get symb 'autocomp-lst))))
	 (mapc (lambda (path)
		 (shell-command (rebet--make-tag-cmd path t (list (cons tag val)))))
	       files)
	 ;; update refs the new way
	 ))

     (defun rebet-change-tag-globally ()
       (interactive)
       (rebet--make-ref-lists)
       (let* ((ref-file (expand-file-name rebet--ref-file))
	      (tag (completing-read "Change which tag? "
				    (mapcar (lambda (x) (get x 'tagname)) rebet--attributes) nil t))
	      (symb (seq-find (lambda (x) (string= (get x 'tagname) tag)) rebet--attributes))
	      (oldval (completing-read (concat tag " value to change: ")
				       (get symb 'autocomp-lst)))
	      (newval (completing-read (concat "Change " tag " \"" oldval "\" to: ")
				       (get symb 'autocomp-lst))))
	 (unless (string= oldval newval)
	   (with-temp-buffer
	     (insert-file-contents ref-file)
	     (let ((matching (mapcar
			      (lambda (ln)
				(replace-regexp-in-string
				 "path:" ""
				 (seq-find (lambda (x) (string-match-p "path:" x))
					   (split-string ln "|"))))
			      (seq-remove
			       (lambda (x) (not (string-match-p (concat tag ":" oldval) x)))
			       (split-string (buffer-string) "\n")))))
	       (mapc (lambda (path)
		       (if (file-exists-p path)
			   (shell-command (rebet--make-tag-cmd path t (list (cons tag newval))))))
		     matching))))
	 (with-temp-file ref-file
	   (insert-file-contents ref-file)
	   (goto-char (point-min))
	   (while (search-forward (concat tag ":" oldval) nil t)
	     (replace-match (concat tag ":" newval))))))
     #+end_src

** New code

*** Reference file new approach

    The reference file should be built and managed like this:

    1. a function will check for paths not already in the file and update those
    2. when updating a tag, the according entry in the file should be
       deleted and the new one should be added afterwards, like such: after
       setting the tag, get the values and build the entry.

       #+begin_src emacs-lisp
       (defun rebet--ref-get-path (ln)
	 (replace-regexp-in-string "path:" ""
				   (seq-find (lambda (x) (string-match-p "path:" x))
					     (split-string ln "|"))))

       (defun rebet--ref-line-format (path var-list)
	      "Formats the string to put in ref file."
	      (concat "|" (mapconcat
			   (lambda (x) (concat (car x) ":" (cdr x)))
			   var-list "|")
		      "|path:" path))

       (defun rebet--ref-remove-nonexistent ()
	 "Removes entries with non-existent paths from the reference file."
	 (let ((ref-file (expand-file-name rebet--ref-file)))
	   (unless (file-exists-p ref-file)
	     (user-error "Error: the reference file was not found (%s)" ref-file))
	   (with-temp-file ref-file
	     (insert-file-contents ref-file)
	     (mapc (lambda (ln)
		     (let ((path (rebet--ref-get-path ln)))
		       (unless (file-exists-p path)
			 (flush-lines path (point-min) (point-max)))))
		   (split-string (buffer-string) "\n")))))

       (defun rebet--ref-remove-lines (match)
	 "Remove lines containing MATCH from ref-file."
	 (let ((ref-file (expand-file-name rebet--ref-file)))
	   (unless (file-exists-p ref-file)
	     (user-error "Error: the reference file was not found (%s)" ref-file))
	   (with-temp-file ref-file
	     (insert-file-contents ref-file)
	     (flush-lines match (point-min) (point-max)))))

       (defun rebet--mk-ref (&optional path)
	 "Writes lines to `rebet--ref-file'. If PATH is not set, it will
	 act on every mp3 file in `rebet-default-dir' recursively. If
	 PATH is a directory, it will act in all .mp3 files in there,
	 non-recursively. If PATH corresponds to a single file, it will
	 act only on this file. With a prefix argument it replaces the
	 file with the new content.

       For the exact line formatting, see `rebet--ref-line-format'"
	 (interactive)
	 (let ((ref-file (expand-file-name rebet--ref-file))
	       (path (if (not path)
			 (directory-files-recursively (expand-file-name rebet-default-dir) "mp3")
		       (if (file-directory-p path)
			   (directory-files (expand-file-name path) t "mp3")
			 (if (file-exists-p path)
			     (list (expand-file-name path)))))))
	   (if current-prefix-arg (delete-file ref-file))
	   (if path
	       (with-temp-file ref-file
		 (if (file-exists-p ref-file) (insert-file-contents ref-file))
		 (mapc (lambda (file)
			 (message "%s" file)
			 (flush-lines file (point-min) (point-max))
			 (insert
			  (concat (rebet--ref-line-format file (rebet--get-data-from-id3 file)) "\n")))
		       path)))))
       #+end_src
    
       
*** Changing tags

    I might end up completely re-designing the functionality here...
    
    Anyway, here is the design overview for changing tags:

    1. Specify the file(s) and tag(s)
    2. Run the command.
    3. If the command succeeds, use the old filename to remove the entry
       from the ref-file (remove-lines)
    4. Run mk-ref to the directory path (this is a hack due to the fact
       that I cannot currently have access to the new filename, as the
       renaming is handled by the shell script)

    Notes on this procedure:

    - Maybe the whole renaming and stuff should be handled in emacs too. As
      of now, almost all of the aspects of this procedure are covered in
      emacs anyway.
      
** Redesigning

   So: the conclusion is that I should drop my shell script and implement
   setting the tags by using directly eyeD3. This will provide better
   integration with all the parts of the functionality.

