rebet.el

;; interactive functions

;;;###autoload
(defun rebet-update-all-refs ()
  "Run to initialize reference file and variables, according to
the mp3 files in `rebet-default-dir'. Calls
`rebet--make-ref-file' and `rebet--make-ref-lists'
consecutively."
  (interactive)
  (rebet--make-ref-file)
  (rebet--make-ref-lists))

;;;###autoload
(defun rebet-tags-to-props (&optional path)
   "Works only in `rebet-lyrics-file'. Reads ID3 tags from a
   selected mp3 file and converts them to org-properties in the
   entry at point. It also updates the heading, in case it
   differs from the actual title. If PATH is specified, it reads
   from this file, else it calls counsel-fzf."
  (interactive)
  (unless (string= buffer-file-name (expand-file-name rebet-lyrics-file))
    (user-error "Error: Not in the lyrics file (%s)" rebet-lyrics-file))
  (let* ((process-environment (cons (rebet--set-fzf-cmd)
				    process-environment))
	 (path (if path (expand-file-name path)
		 (l/counsel-fzf-as-text "Get props from: ")))
	 (song-data (rebet--get-data-from-id3 path))
	 (entry-data (org-entry-properties)))
    (mapc (lambda (attr)
	    (org-set-property
	     (get attr 'propname) (cdr (assoc (get attr 'tagname) song-data))))
	  (seq-remove (lambda (x) (string= (get x 'tagname) "title"))
		      rebet--attributes))
    (mapc (lambda (x)
	    (if (string-match-p "^ *$" (cdr (assoc (get x 'propname)
						   (org-entry-properties))))
		(org-delete-property (get x 'propname))))
	  rebet--attributes)
    (org-edit-headline (cdr (assoc "title" song-data))))
    ;; do not update data -- thought: maybe use rebet-autocompletion?
    (if mark-active (deactivate-mark t)))

;;;###autoload
(defun rebet-props-to-tags (&optional path)
   "Works only in `rebet-lyrics-file'. Reads the properties from
   the current entry and converts them to ID3 tags of a selected
   mp3 file, also renaming it if necessary. If PATH is provided,
   it acts on this file, else it calls counsel-fzf."
  (interactive)
  (unless (string= buffer-file-name (expand-file-name rebet-lyrics-file))
    (user-error "Error: Not in the lyrics file (%s)" rebet-lyrics-file))
  (let* ((process-environment (cons (rebet--set-fzf-cmd)
				    process-environment))
	 (song-data (rebet--get-data-from-props))
	 (path (if path (expand-file-name path)
		 (l/counsel-fzf-as-text "Give props to: "))))
    (shell-command (rebet--make-tag-cmd path t song-data))
    (rebet--add-line-to-ref path song-data))
  (if mark-active (deactivate-mark t)))


;;;###autoload
(defun rebet-tags-to-props-and-back (&optional path)
  "Sequentially calls `rebet-tags-to-props' and
   `rebet-org-to-tags' on a specified file. If PATH is set it
   acts on this file, if not, it calls counsel-fzf."
  (interactive)
  (let* ((process-environment
	  (cons (rebet--set-fzf-cmd) process-environment))
	 (path (if path (expand-file-name path)
		 (l/counsel-fzf-as-text "Props come and go :"))))
    (rebet-tags-to-props path)
    (rebet-props-to-tags path)))

;;;###autoload
(defun rebet-dired-mp3-tag-editor ()
  "Simple interface directly to the mp3-tag-editor shell script,
   using `make-term'. No completions and no updating lists etc
   with new values. Acts on the marked files of the current dired
   buffer."
  (interactive)
  (let ((files (dired-get-marked-files)))
    (apply 'make-term "mp3-tag-editor" "sh" nil "mp3-tag-editor" "-ER" files)
    (switch-to-buffer-other-window "*mp3-tag-editor*")))

;;;###autoload
(defun rebet-dired-set-tags ()
  (interactive)
  (rebet--make-ref-lists)
  (let ((files (dired-get-marked-files)))
    (mapc (lambda (file)
	    (let ((def-values (rebet--get-data-from-id3 file))
		  (fname (file-name-base file)))
	      (mapc (lambda (attr)
		      (let ((defval (cdr (assoc (get attr 'tagname) def-values))))
			(put attr 'val
			     (completing-read
			      (concat fname " | " (get attr 'tagname) ": ")
			      (get attr 'autocomp-lst) nil nil defval))))
		    rebet--attributes)
	      ;; use the data to make the command and also add to the ref-file
	      ))
	  files)))

(provide 'rebet)
