rebet.org
*** Better defined parts

    1. Reference file. Everything concerning the creation and update of the
       reference file.
    2. Lyrics file. Storing lyrics and setting org-props. Also, updating
       entries from exisiting ID3 tags or the opposite, updating existing
       files with tags extracted from the org props. This intersects with
       the next piece.
    3. Files manipulation. Setting tags and renaming (and maybe also
       moving??) mp3 files.

*** Re-evaluating already written functions

    Here is the list of the functions still in use after the new implementation:
    
    - rebet--get-data-from-id3: this extracts information from an mp3
      file and stores it in an association list of the form ((<tag> .
      <value>)). This form is then used throughout the code.
    - rebet--set-fzf-command: (needs renaming) this will create the
      string that will set the fzf command to point to the correct
      directory when called to look for a file.
    - rebet--make-ref-lists: this will create lists of values from the
      reference file. Used for autocompletion when setting tags.
    - rebet--make-ref-line: (renamed to 'rebet--ref-line-format') this
      creates the reference file's line format.
    - rebet-tags-to-props: updates the org-properties based on ID3 tags
      of file
    - rebet-tags-to-props-and-back: this calls rebet-tags-to-props and
      then proceeds to update the file again with newly defined
      properties.

    All other functionality will be redesigned. Already most of the
    'Reference file' functionality (1) is finished.

*** Setting tags using eyeD3

    This should be the basis of the new approach. It will essentially be
    the opposite of 'rebet--get-data-from-id3' in the sense that it's input
    will be of the same format as the output of this function, meaning an
    associative array of the form ((<tag> . <value>)). By this it will
    produce the eyeD3 command.

    #+begin_src emacs-lisp
    (defun rebet--set-tags (path val-list)
      "Set the id3 tags of the file in PATH, using values from VAL-LIST.
	VAL-LIST should be of the form ((<tag> . <value>)).
    Uses the eyeD3 program."
      (let ((optlist (mapcar
		      (lambda (attr)
			(cons (get attr 'eye-opt) (cdr (assoc (get attr 'tagname) val-list))))
		      (seq-remove (lambda (x)
				    (not (car (assoc (get x 'tagname) val-list))))
				  rebet--attributes)))
	    (path (expand-file-name path)))
	(shell-command (concat "eyeD3 " (shell-quote-argument path) " "
			       (mapconcat
				(lambda (x)
				  (concat (car x) (shell-quote-argument (cdr x))))
				optlist " ")))))
    #+end_src

    Now, some other stuff: I need a function for renaming.

    I will define a function creating the template used for naming.

    #+begin_src emacs-lisp
    (defun rebet--make-name-string (val-list)
      "Formats the string for file names using values in VAL-LIST.

    Naming is of the form:
    - <artist> - <title>, if <composer> is nil, or if <composer> is the same as <artist>
    - <composer> (<artist>) - <title> otherwise.

    If <title> or both <artist> and <composer> are nil, the name is also nil."
      (let* ((artist (cdr (assoc "artist" val-list)))
	     (composer (cdr (assoc "composer" val-list)))
	     (title (cdr (assoc "title" val-list)))
	     (creators (if artist
			   (if (or (not composer) (string= composer artist))
			       artist
			     (concat composer " (" artist ")")))))
	(if (and title creators)
	    (concat creators " - " title))))

    (defun rebet--rename (path val-list)
      "Renames a file in PATH using values from VAL-LIST.

    Renaming occurs only if the current file name is different from the new file name and the file has an mp3 extension.

    See `rebet--make-name-string' for the formatting of the file name."
      (let* ((path (expand-file-name path))
	     (oldname (file-name-base path))
	     (dir (file-name-directory path))
	     (ext (file-name-extension path))
	     (newname (rebet--make-name-string val-list)))

	(unless (or (string= oldname newname) (not (string= ext "mp3")) (not newname))
	  (rename-file path (concat dir newname "." ext))
	  (when (eq major-mode 'dired-mode)
	    (revert-buffer)))))
    #+end_src

** Epilogue

   Just ending the code...

   #+begin_src emacs-lisp
   (provide 'rebet)
   ;;; rebet.el ends here
   #+end_src
